BusinessProcesses/СогласованиеЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<BusinessProcess>
		<Properties>
			<Name>СогласованиеЦенНоменклатуры</Name>
			<Task>Task.ЗадачаСогласованияЦен</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрименения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПочтыИнициатора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУстановкиЦен</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПлановогоИзменения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлановоеИзменениеЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСогласования1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованиеВыполнено1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСогласования2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованиеВыполнено2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСогласования3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованиеВыполнено3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентКанала</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

BusinessProcesses/СогласованиеЦенНоменклатуры/Ext/ObjectModule.bsl
Процедура НачатьСогласованиеПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Сообщить("Не заполнена номенклатура.");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаПрименения) Или НачалоДня(ДатаПрименения) < НачалоДня(ТекущаяДата()) Тогда
		Сообщить("Дата применения не может быть меньше текущей даты.");
		Отказ = Истина;
	КонецЕсли;
	
	Если Цены.Количество() = 0 Тогда
		Сообщить("Не заполнены цены для согласования.");
		Отказ = Истина;
	КонецЕсли;
	
	Для НомерСогласующего = 1 По 3 Цикл
		Если СогласованиеЦенНоменклатурыСервер.ПолучитьСогласующего(Номер) = Неопределено Тогда
			Сообщить("В регистре сведений ""Согласующие цен номенклатуры"" не заполнен согласующий " + Номер + ".");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Согласование1ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьИсполнителяЗадач(ФормируемыеЗадачи, 1, Отказ);
	
КонецПроцедуры

Процедура Согласование2ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьИсполнителяЗадач(ФормируемыеЗадачи, 2, Отказ);
	
КонецПроцедуры

Процедура Согласование3ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьИсполнителяЗадач(ФормируемыеЗадачи, 3, Отказ);
	
КонецПроцедуры

Процедура Согласование1ПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ПроверитьЧтоРешениеПринято(Задача, Отказ);
	
КонецПроцедуры

Процедура Согласование2ПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ПроверитьЧтоРешениеПринято(Задача, Отказ);
	
КонецПроцедуры

Процедура Согласование3ПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ПроверитьЧтоРешениеПринято(Задача, Отказ);
	
КонецПроцедуры

Процедура Согласование1ПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ЗафиксироватьРешение(1, Задача);
	
КонецПроцедуры

Процедура Согласование2ПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ЗафиксироватьРешение(2, Задача);
	
КонецПроцедуры

Процедура Согласование3ПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ЗафиксироватьРешение(3, Задача);
	Согласовано = Задача.Согласовано;
	Записать();
	
КонецПроцедуры

Процедура ЦеныСогласованыПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = Согласовано;
	
КонецПроцедуры

Процедура ПрименитьЦеныОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	СогласованиеЦенНоменклатурыСервер.СоздатьДокументПоСогласованию(ЭтотОбъект);
	СогласованиеЦенНоменклатурыСервер.ОтправитьПисьмоОтделуПродаж(ЭтотОбъект);
	
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	СогласованиеЦенНоменклатурыСервер.ОтправитьУведомлениеОРезультате(ЭтотОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьИсполнителяЗадач(ФормируемыеЗадачи, Номер, Отказ)
	
	Согласующий = СогласованиеЦенНоменклатурыСервер.ПолучитьСогласующего(Номер);
	Если Согласующий = Неопределено Тогда
		Сообщить("Не заполнен согласующий " + Номер + ".");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Исполнитель = Согласующий.Пользователь;
		Задача.НомерСогласующего = Номер;
		Задача.Наименование = Лев("Согласование цен: " + Строка(Номенклатура) + " (согласующий " + Номер + ")", 150);
		Задача.Дата = ТекущаяДата();
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЧтоРешениеПринято(Задача, Отказ)
	
	Если Не Задача.РешениеПринято Тогда
		Сообщить("Укажите результат в форме задачи: согласовать или отказать.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьРешение(Номер, Задача)
	
	ЭтотОбъект["СогласованиеВыполнено" + Номер] = Истина;
	ЭтотОбъект["РезультатСогласования" + Номер] = Задача.Согласовано;
	ЭтотОбъект["Комментарий" + Номер] = Задача.Комментарий;
	ЭтотОбъект["ДатаРешения" + Номер] = ТекущаяДата();
	
	Если Номер < 3 Тогда
		Записать();
	КонецЕсли;
	
КонецПроцедуры
